Revit 2024 API
IConnector.Height Property
The height of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
double Height { get; }
Visual Basic
ReadOnly Property Height As Double
	Get
Visual C++
property double Height {
	double get ();
}
Remarks
This property is used to retrieve the height of the connector.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the connector's shape is not rectangular.
See Also
IConnector Interface
Autodesk.Revit.DB Namespace